---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarHostData
source: html/820499bf-75d0-5514-03f2-9ee619eb4920.htm
---
# RebarHostData Properties

Specifies whether the .NET object represents a valid Revit entity.